tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

brew "ag"
brew "aria2"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bison"
brew "chruby"
brew "coreutils"
brew "cscope"
brew "direnv"
brew "docker"
brew "fasd"
brew "gdbm"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "jq"
brew "lastpass-cli"
brew "libffi"
brew "libyaml"
brew "mysql", restart_service: true
brew "neovim"
brew "openssl"
brew "pinentry-mac"
brew "postgresql@9.4", restart_service: true
brew "python3"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-install"
brew "tig"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "watch"
brew "pcre"   #secretly required for wget
brew "wget"

cask "atom"
cask "caskroom/fonts/font-firacode-nerd-font"
cask "caskroom/versions/firefox-nightly"
#cask "caskroom/versions/iterm2"
cask "caskroom/versions/java8"
#cask "caskroom/versions/slack-beta"
cask "docker"
cask "flycut"
cask "goland"
cask "google-cloud-sdk"
cask "iterm2"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

# cloudfoundry
tap "cloudfoundry/tap"
brew "cloudfoundry/tap/bosh-cli"

# kubernetes
brew "kubernetes-cli"
tap "boz/repo"
brew "boz/repo/kail"
tap "derailed/k9s"
brew "derailed/k9s/k9s"

# load testing
brew "hey"
brew "vegeta"
brew "wrK"

# pairing
tap "git-duet/tap"
brew "git-duet/tap/git-duet"